In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

In [2]:
sql = '''
SELECT name, COUNT(*)
FROM dividends
GROUP BY name
ORDER BY COUNT(*) DESC, name ASC'''
dividends = pd.read_sql(sql, conpf)
dividends

       name  COUNT(*)
0     JASIF        12
1       IVL        11
2   CPNREIT         9
3       DIF         9
4        LH         7
..      ...       ...
68     TPCH         1
69      TTW         1
70    VIBHA         1
71      VNT         1
72      WHA         1

[73 rows x 2 columns]

In [3]:
sql = '''
SELECT year, quarter, SUM(net) AS ttl_net
FROM dividends
GROUP BY year, quarter
ORDER BY year DESC, quarter DESC'''
ttl_by_qtr = pd.read_sql(sql, conpf)
ttl_by_qtr

    year  quarter    ttl_net
0   2020        4    2316.60
1   2020        3   64070.50
2   2020        2  146973.05
3   2020        1   43855.01
4   2019        4  313584.70
5   2019        3   72131.65
6   2019        2  138670.80
7   2019        1   39528.50
8   2018        4  270173.60
9   2018        3   38905.90
10  2018        2   79365.50
11  2018        1  208866.18
12  2017        4    8910.00
13  2017        2   54624.15
14  2016        4  177990.08

In [4]:
sql = '''
SELECT year, SUM(net) AS ttl_net
FROM dividends
GROUP BY year
ORDER BY year DESC'''
ttl_by_year = pd.read_sql(sql, conpf)
ttl_by_year.head()

   year    ttl_net
0  2020  257215.16
1  2019  563915.65
2  2018  597311.18
3  2017   63534.15
4  2016  177990.08

In [5]:
ttl_by_year.ttl_net.sum()

1659966.2200000002

In [6]:
sql = '''
SELECT name, COUNT(*) AS qtrs, SUM(net) AS ttl_net
FROM dividends
GROUP BY name
ORDER BY SUM(net) DESC'''
total = pd.read_sql(sql, conpf)
total.head(30)

       name  qtrs    ttl_net
0     JASIF    12  217200.00
1       MCS     7  193470.00
2       DIF     9  114589.50
3   CPNREIT     9  100219.10
4       SAT     4   92389.88
5     NOBLE     2   86130.00
6        LH     7   81675.00
7    FSMART     6   75384.00
8     TISCO     2   58050.00
9       ORI     6   53325.00
10    PTTGC     4   37530.00
11      IVL    11   35595.00
12    SYNEX     5   33774.00
13       BA     4   32340.00
14     STPI     1   31200.00
15     ANAN     2   29709.00
16    BANPU     5   28485.00
17    ROJNA     2   27000.00
18      KKP     2   24570.00
19    AMATA     6   18009.00
20     SENA     3   15787.22
21    PTTEP     2   15390.00
22      JMT     2   12798.00
23      KTB     1   12384.00
24    TTLPF     5   11741.57
25   ADVANC     2   11016.00
26       BR     1   10943.64
27       AP     1    9450.00
28      VNT     1    9360.00
29     MEGA     4    9274.00

### Average cost calculation

In [2]:
name = 'DIF'

sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS amt, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys

    id name        date    qty  price       amt  status kind
0  783  DIF  2020-10-20   8000   12.8  102400.0  Active  DIV
1  781  DIF  2020-10-09   2000   13.3   26600.0  Active  DIV
2  745  DIF  2020-06-24  20000   16.4  328000.0  Active   HD
3  637  DIF  2019-07-24  20000   16.4  328000.0  Active   HD
4  617  DIF  2019-05-15  20000   16.4  328000.0  Active   SS

In [3]:
buys_grp = buys.groupby(by=['name'])
buys_df = buys_grp['amt','qty'].sum()
buys_df['unit_cost'] = buys_df.amt / buys_df.qty
buys_df

            amt    qty  unit_cost
name
DIF   1113000.0  70000       15.9

### Recalculate cost when unit cost changes

In [6]:
name = 'DIF'
sql = '''
SELECT *
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE status = "Active" AND name = '%s'
ORDER BY date'''
sql = sql % name
print(sql)

SELECT *
FROM buys B
JOIN stocks S ON B.stock_id = S.id
WHERE status = "Active" AND name = 'DIF'
ORDER BY date

In [7]:
df_tmp = pd.read_sql(sql, conpf)
df_tmp

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart,id,name,category_id,website
0,617,81,2019-05-15,20000,16.4,678.96,47.53,Active,328726.49,SS,None,81,DIF,3,www.digital-tif.com
1,637,81,2019-07-24,20000,16.4,678.96,47.53,Active,328726.49,HD,None,81,DIF,3,www.digital-tif.com
2,745,81,2020-06-24,20000,16.4,678.96,47.53,Active,328726.49,HD,None,81,DIF,3,www.digital-tif.com

In [5]:
stock_id = 81
qty = 20000
price = 16.4
fee = 678.96
vat = 47.53
net = 328726.49
print(stock_id,qty,price,fee,vat,net)

81 20000 16.4 678.96 47.53 328726.49

In [6]:
def update_buys(qty,price,fee,vat,net,stock_id):
    sql = "UPDATE buys SET qty = %s, price = %s, fee = %s, vat = %s, net = %s WHERE stock_id = %s AND status = 'Active'"
    sql = sql % (qty,price,fee,vat,net,stock_id)
    rp = conpf.execute(sql)
    return "Records updated = " + str(rp.rowcount)

In [7]:
update_buys(qty,price,fee,vat,net,stock_id)

'Records updated = 3'

### On demand process to change value of kind

In [4]:
name = 'DIF'

sql = '''
SELECT B.id, S.name, date, qty, price, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" 
ORDER BY id'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys

    id name        date    qty  price  status kind
0  556  DIF  2018-09-07  40000  14.95    Sold   HD
1  617  DIF  2019-05-15  20000  16.40  Active   SS
2  622  DIF  2019-06-14  10000  16.60    Sold   HD
3  637  DIF  2019-07-24  20000  16.40  Active   HD
4  745  DIF  2020-06-24  20000  16.40  Active   HD
5  781  DIF  2020-10-09   2000  13.30  Active  DIV
6  783  DIF  2020-10-20   8000  12.80  Active  DIV

In [5]:
sql = '''
UPDATE buys
SET kind = "DIV"
WHERE id IN (556,617,622,637,745,781,783)
'''
print(sql)

UPDATE buys
SET kind = "DIV"
WHERE id IN (556,617,622,637,745,781,783)

In [6]:
rp = conpf.execute(sql)
rp.rowcount

7

### Summarized profit by name

In [ ]:
sql = '''
SELECT name, sum(profit) AS profit
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
GROUP BY stocks.name
ORDER BY sum(profit) DESC LIMIT 10'''
profits_by_stock = pd.read_sql(sql, conpf)
profits_by_stock

In [ ]:
sql = '''
SELECT YEAR(date) AS year, MONTH(date) AS month, profit
FROM sells 
'''
sells = pd.read_sql(sql, conpf)
sells.dtypes

In [ ]:
grouped = sells.groupby(['year','month'])
grouped

In [ ]:
profit_by_month = grouped['profit'].sum()
profit_by_month

In [ ]:
grouped.agg(['sum','mean', 'max', 'min','count'])

### Special process to delete old data

In [ ]:
sql = '''
SELECT S.name, status, YEAR(B.date) AS year, COUNT(*) AS items
FROM buys B JOIN stocks S ON B.stock_id = S.id
GROUP BY S.name, status, YEAR(B.date)
ORDER BY S.name, status'''
buys = pd.read_sql(sql, conpf)
buys.head()

In [ ]:
name = 'SAT'
status = 'Sold'

In [ ]:
sql = '''
SELECT S.name, date, qty, price, net, status, B.id 
FROM buys B JOIN stocks S on B.stock_id = S.id 
WHERE name = "%s" AND status = "%s"
ORDER BY B.id DESC
'''
sql = sql % (name, status)
buys = pd.read_sql(sql, conpf)
buys['cost'] = buys.qty * buys.price
buys

In [ ]:
buys_grouped = buys.groupby(by='name')
buys_grouped.size()

In [ ]:
buys_grouped.describe()

In [ ]:
buys_sum = buys_grouped['qty cost'.split()].sum()
buys_sum['unit_cost'] = buys_sum.cost / buys_sum.qty
buys_sum

In [ ]:
sql = '''
SELECT T.name, S.date AS Sell_date, B.date AS Buy_date, 
days, qty, S.price AS Sell, B.price AS Buy, 
S.price - B.price AS Unit_Profit, (S.price - B.price) * qty AS Profit, percent 
FROM sells S JOIN buys B ON S.buy_id = B.id 
JOIN stocks T on B.stock_id = T.id 
WHERE name = "%s"
ORDER BY S.date
'''
sql = sql % (name)
sells = pd.read_sql(sql, conpf)
sells

In [ ]:
sells['profit'] = (sells.Sell - sells.Buy) * sells.qty

sells_grouped = sells.groupby(by='name')
sells_grouped.size()

In [ ]:
sells_sum = sells_grouped['qty profit'.split()].sum()
sells_sum['unit_profit'] = sells_sum.profit / sells_sum.qty
sells_sum

### Delete old data process

In [ ]:
sql = '''
SELECT * FROM sells WHERE EXISTS ( 
SELECT * FROM buys, stocks 
WHERE sells.buy_id = buys.id 
AND buys.stock_id = stocks.id 
AND stocks.name = "%s" 
AND YEAR(sells.date) < 2017
AND YEAR(buys.date)  < 2017)
'''
sql = sql % (name)
sells = pd.read_sql(sql, conpf)
sells

In [ ]:
sql = '''
DELETE FROM sells WHERE EXISTS ( 
SELECT * FROM buys, stocks 
WHERE sells.buy_id = buys.id 
AND buys.stock_id = stocks.id 
AND stocks.name = "%s" 
AND YEAR(buys.date)  < 2017)
'''
sql = sql % (name)
print(sql)

In [ ]:
rp = conpf.execute(sql)
rp.rowcount

In [ ]:
sql = '''SELECT * FROM buys WHERE EXISTS ( 
SELECT * FROM stocks 
WHERE buys.stock_id = stocks.id 
AND stocks.name = "%s" 
AND buys.status = "Sold" 
AND YEAR(buys.date) < 2017 )
'''
sql = sql % (name)
buys = pd.read_sql(sql, conpf)
buys

In [ ]:
sql = '''DELETE FROM buys WHERE EXISTS ( 
SELECT * FROM stocks 
WHERE buys.stock_id = stocks.id 
AND stocks.name = "%s" 
AND buys.status = "Sold"
AND YEAR(buys.date) < 2017 )
'''
sql = sql % (name)

rp = conpf.execute(sql)
rp.rowcount

### If there are records in this process, must manually delete sell records

In [ ]:
sql = '''SELECT o.* FROM sells o WHERE NOT EXISTS ( 
SELECT * FROM buys b, stocks s 
WHERE o.buy_id = b.id
AND b.stock_id = s.id
)
ORDER BY o.id
'''
sql = sql 
temp = pd.read_sql(sql, conpf)
temp

In [ ]:
oid = 279
sql = '''
SELECT o.id,s.name,b.status,b.date,o.date 
FROM sells o LEFT JOIN buys b ON o.buy_id = b.id
LEFT JOIN stocks s ON b.stock_id = s.id
WHERE o.id = %s'''
sql = sql % oid
rcd = pd.read_sql(sql, conpf)
rcd

In [ ]:
sql = '''
DELETE FROM sells
WHERE id = %s'''
sql = sql % oid
rp = conpf.execute(sql)
rp.rowcount

In [ ]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.columns

In [ ]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.columns

In [ ]:
sql = '''
SELECT * FROM stocks 
WHERE name IN ('MTLS', 'MTC')'''
stocks = pd.read_sql(sql, conpf)
stocks

In [ ]:
sql = '''
SELECT * FROM buys 
WHERE stock_id IN (74, 137)'''
buys = pd.read_sql(sql, conpf)
buys

In [ ]:
sql = '''
UPDATE buys
SET stock_id = 137
WHERE stock_id = 74'''
rp = conpf.execute(sql)
rp.rowcount